In [9]:
import pandas as pd
import numpy as np

Reading a file

In [10]:
movies_list = pd.read_csv(r"C:\Users\User\Downloads\tmdb-movies (1).csv")
movies_list.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10866 entries, 0 to 10865
Data columns (total 21 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   id                    10866 non-null  int64
 1   imdb_id               10856 non-null  object
 2   popularity            10866 non-null  float64
 3   budget                10866 non-null  int64
 4   revenue               10866 non-null  int64
 5   original_title        10866 non-null  object
 6   cast                  10790 non-null  object
 7   homepage              2936 non-null   object
 8   director              10822 non-null  object
 9   tagline               8042 non-null   object
 10  keywords              9373 non-null   object
 11  overview              10862 non-null  object
 12  runtime               10866 non-null  int64
 13  genres                10843 non-null  object
 14  production_companies  9836 non-null   object
 15  release_date          10866 non-null  object
 16  vote_count            10866 non-null  int64
 17  vote_average          10866 non-null  float64
 18  release_year          10866 non-null  int64
 19  budget_adj            10866 non-null  float64
 20  revenue_adj           10866 non-null  float64
dtypes: float64(4), int64(6), object(11)
memory usage: 1.7+ MB

1) Which are the movies with the third lowest and third highest budget?

In [11]:
df1 = pd.DataFrame(movies_list.loc[:,['original_title','budget']])
df1.sort_values("budget",axis = 0,ascending = False,inplace = True, na_position ='last')
df1.head()

                                   original_title     budget
2244                            The Warrior's Way  425000000
3375  Pirates of the Caribbean: On Stranger Tides  380000000
7387     Pirates of the Caribbean: At World's End  300000000
14                        Avengers: Age of Ultron  280000000
6570                             Superman Returns  270000000

In [12]:
df1 = df1[df1.budget != 0]
df1.tail(10)

                           original_title  budget
8235                  Tales from the Hood       6
1313          Des Lendemains Qui Chantent       5
3765                 Death of a Superhero       3
2398                                  Boy       3
10050  Tales from the Darkside: The Movie       3
8944                         Death Wish 2       2
3581              Love, Wedding, Marriage       1
2618                         Lost & Found       1
1151                          Fear Clinic       1
3065   Angus, Thongs and Perfect Snogging       1

2) Which are the movies with most and least earned revenue?

In [13]:
df2 = pd.DataFrame(movies_list.loc[:,['original_title','revenue']])
df2.sort_values("revenue",axis = 0,ascending = False,inplace = True, na_position ='last')
df2.head()

                    original_title     revenue
1386                        Avatar  2781505847
3     Star Wars: The Force Awakens  2068178225
5231                       Titanic  1845034188
4361                  The Avengers  1519557910
0                   Jurassic World  1513528810

In [14]:
df2 = df2[df2.revenue != 0]
df2.tail()

                       original_title  revenue
10607                   Soylent Green        3
1380                     The Sentinel        3
3239   Dr. Horrible's Sing-Along Blog        3
5067                  Shattered Glass        2
8142                         Mallrats        2

3) What is the average runtime of movies in the year 2006?

In [15]:
df3 =pd.DataFrame(movies_list.loc[:,['original_title','release_year','runtime']])
df3 = df3.loc[df3['release_year'] == 2006]
avg = df3['runtime'].mean(axis=0)
print(avg)

101.68382352941177

4) Name any 3 production companies which have invested money in worse revenue movies?

In [16]:
df4 = pd.DataFrame(movies_list.loc[:,['original_title','revenue','production_companies']])
df4.sort_values("revenue",axis = 0,ascending = False,inplace = True, na_position ='last')
df4 = df4[df4.revenue != 0]
df4.tail(10)

,original_title,revenue,production_companies
3283,Parlami D'Amore,9,NaN
8226,Never Talk to Strangers,6,TriStar Pictures
10307,The House of the Spirits,6,Det Danske Filminstitut|Spring Creek Productio...
5162,Kid's Story,5,Studio 4Â°C
8523,Bordello of Blood,5,Tales From The Crypt Holdings|Universal City S...
10607,Soylent Green,3,Metro-Goldwyn-Mayer (MGM)
1380,The Sentinel,3,Universal Pictures
3239,Dr. Horrible's Sing-Along Blog,3,NaN
5067,Shattered Glass,2,Lions Gate Films|Cruise/Wagner Productions|Bau...
8142,Mallrats,2,Gramercy Pictures|Alphaville Films|View Askew ...